---
kind: property
id: P:Autodesk.Revit.DB.ViewSet.Size
source: html/23061e39-a9eb-deec-072d-a80c7f7ec5cd.htm
---
# Autodesk.Revit.DB.ViewSet.Size Property

Returns the number of views that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```